; domain
(define (domain gripper)
   (:requirements :strips :typing)
   (:types room ball gripper)
   (:predicates ;(ROOM ?r)
                ;(BALL ?b)
                ;(GRIPPER ?g)
                (at-robby ?r)
                (at-ball ?b ?r)
                (free ?g)
                (carry ?g ?b))
   (:action move
       :parameters (?x - room ?y - room)
       :precondition (and ;(ROOM ?x)
                          ;(ROOM ?y)
                          (at-robby ?x)
                     )
       :effect (and (at-robby ?y)
                    (not (at-robby ?x))
               )
   )
   (:action pick-up
       :parameters (?ball - ball ?room - room ?gripper - gripper)
       :precondition (and ;(BALL ?ball)
                          ;(ROOM ?room)
                          ;(GRIPPER ?gripper)
                          (at-ball ?ball ?room)
                          (at-robby ?room)
                          (free ?gripper)
                     )
       :effect (and (carry ?gripper ?ball)
                    (not (at-ball ?ball ?room)) 
                    (not (free ?gripper))
               )
   )
   (:action drop
       :parameters (?ball - ball ?room - room ?gripper - gripper)
       :precondition (and ;(BALL ?ball)
                          ;(ROOM ?room)
                          ;(GRIPPER ?gripper)
                          (carry ?gripper ?ball)
                          (at-robby ?room)
                     )
       :effect (and (at-ball ?ball ?room)
                    (free ?gripper)
                    (not (carry ?gripper ?ball))
               )
   )
)

; problem
(define (problem gripper-four-balls)
   (:domain gripper)
   (:objects rooma roomb - room
             ball1 ball2 ball3 ball4 - ball
             left right - gripper)
   (:init ;(ROOM rooma)          (ROOM roomb)
          ;(BALL ball1)          (BALL ball2)
          ;(BALL ball3)          (BALL ball4)
          ;(GRIPPER left)        (GRIPPER right)
          (at-robby rooma)
          (free left)          (free right)
          (at-ball ball1 rooma)  (at-ball ball2 rooma)
          (at-ball ball3 rooma)  (at-ball ball4 rooma)
   )
   (:goal (and (at-ball ball1 roomb)
               (at-ball ball2 roomb)
               (at-ball ball3 roomb)
               (at-ball ball4 roomb)
          )
   )
)

; plan
1. (pick-up ball1 rooma left)
   deleted: (at-ball ball1 rooma) (free left)
   added: (carry left ball1)
   goals met: 0 of 4
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 4
3. (drop ball1 roomb left)
   deleted: (carry left ball1)
   added: (at-ball ball1 roomb) (free left)
   goals met: 1 of 4
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 1 of 4
5. (pick-up ball2 rooma left)
   deleted: (at-ball ball2 rooma) (free left)
   added: (carry left ball2)
   goals met: 1 of 4
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 4
7. (drop ball2 roomb left)
   deleted: (carry left ball2)
   added: (at-ball ball2 roomb) (free left)
   goals met: 2 of 4
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 4
9. (pick-up ball3 rooma left)
   deleted: (at-ball ball3 rooma) (free left)
   added: (carry left ball3)
   goals met: 2 of 4
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 4
11. (drop ball3 roomb left)
   deleted: (carry left ball3)
   added: (at-ball ball3 roomb) (free left)
   goals met: 3 of 4
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 3 of 4
13. (pick-up ball4 rooma left)
   deleted: (at-ball ball4 rooma) (free left)
   added: (carry left ball4)
   goals met: 3 of 4
14. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 4
15. (drop ball4 roomb left)
   deleted: (carry left ball4)
   added: (at-ball ball4 roomb) (free left)
   goals met: 4 of 4
